IDEA StatiCa Open Model
LoadCase.TemperatureLoadsOnLine Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of temperature load in this load case
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<ReferenceElement> TemperatureLoadsOnLine { get; set; }
Public Property TemperatureLoadsOnLine As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ TemperatureLoadsOnLine {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
LoadCase Class
IdeaRS.OpenModel.Loading Namespace